Revit 2027 API
FabricationPart.SetOptionValue Method
 Sets the fabrication option to the specified value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOptionValue(
	FabricationOptionDefinition option,
	double newValue
)
Public Sub SetOptionValue (
	option As FabricationOptionDefinition,
	newValue As Double
)
public:
void SetOptionValue(
	FabricationOptionDefinition^ option,
	double newValue
)
member SetOptionValue :
        option : FabricationOptionDefinition *
        newValue : float -> unit
Parameters
option FabricationOptionDefinition
 The fabrication option to set.
newValue Double
 The new value to set, in Revit internal units.
Exceptions
Exception | Condition
ArgumentException |  The fabrication option is not modifiable. -or- The value is invalid if it is beyond the defined limits.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace